###################################################################

# Created by write_sdc on Fri May 29 16:25:59 2026

###################################################################
set sdc_version 2.1

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current uA
set_max_fanout 10 [current_design]
set_max_transition 0.6 [current_design]
set_load -pin_load 0.05 [get_ports {rdata[31]}]
set_load -pin_load 0.05 [get_ports {rdata[30]}]
set_load -pin_load 0.05 [get_ports {rdata[29]}]
set_load -pin_load 0.05 [get_ports {rdata[28]}]
set_load -pin_load 0.05 [get_ports {rdata[27]}]
set_load -pin_load 0.05 [get_ports {rdata[26]}]
set_load -pin_load 0.05 [get_ports {rdata[25]}]
set_load -pin_load 0.05 [get_ports {rdata[24]}]
set_load -pin_load 0.05 [get_ports {rdata[23]}]
set_load -pin_load 0.05 [get_ports {rdata[22]}]
set_load -pin_load 0.05 [get_ports {rdata[21]}]
set_load -pin_load 0.05 [get_ports {rdata[20]}]
set_load -pin_load 0.05 [get_ports {rdata[19]}]
set_load -pin_load 0.05 [get_ports {rdata[18]}]
set_load -pin_load 0.05 [get_ports {rdata[17]}]
set_load -pin_load 0.05 [get_ports {rdata[16]}]
set_load -pin_load 0.05 [get_ports {rdata[15]}]
set_load -pin_load 0.05 [get_ports {rdata[14]}]
set_load -pin_load 0.05 [get_ports {rdata[13]}]
set_load -pin_load 0.05 [get_ports {rdata[12]}]
set_load -pin_load 0.05 [get_ports {rdata[11]}]
set_load -pin_load 0.05 [get_ports {rdata[10]}]
set_load -pin_load 0.05 [get_ports {rdata[9]}]
set_load -pin_load 0.05 [get_ports {rdata[8]}]
set_load -pin_load 0.05 [get_ports {rdata[7]}]
set_load -pin_load 0.05 [get_ports {rdata[6]}]
set_load -pin_load 0.05 [get_ports {rdata[5]}]
set_load -pin_load 0.05 [get_ports {rdata[4]}]
set_load -pin_load 0.05 [get_ports {rdata[3]}]
set_load -pin_load 0.05 [get_ports {rdata[2]}]
set_load -pin_load 0.05 [get_ports {rdata[1]}]
set_load -pin_load 0.05 [get_ports {rdata[0]}]
set_load -pin_load 0.05 [get_ports ready]
set_load -pin_load 0.05 [get_ports irq]
set_load -pin_load 0.05 [get_ports pwr_compute_en]
create_clock [get_ports clk]  -period 6.2  -waveform {0 3.1}
set_clock_uncertainty -setup 0.25  [get_clocks clk]
set_clock_uncertainty -hold 0.05  [get_clocks clk]
set_input_delay -clock clk  1  [get_ports rst_n]
set_input_delay -clock clk  1  [get_ports {addr[31]}]
set_input_delay -clock clk  1  [get_ports {addr[30]}]
set_input_delay -clock clk  1  [get_ports {addr[29]}]
set_input_delay -clock clk  1  [get_ports {addr[28]}]
set_input_delay -clock clk  1  [get_ports {addr[27]}]
set_input_delay -clock clk  1  [get_ports {addr[26]}]
set_input_delay -clock clk  1  [get_ports {addr[25]}]
set_input_delay -clock clk  1  [get_ports {addr[24]}]
set_input_delay -clock clk  1  [get_ports {addr[23]}]
set_input_delay -clock clk  1  [get_ports {addr[22]}]
set_input_delay -clock clk  1  [get_ports {addr[21]}]
set_input_delay -clock clk  1  [get_ports {addr[20]}]
set_input_delay -clock clk  1  [get_ports {addr[19]}]
set_input_delay -clock clk  1  [get_ports {addr[18]}]
set_input_delay -clock clk  1  [get_ports {addr[17]}]
set_input_delay -clock clk  1  [get_ports {addr[16]}]
set_input_delay -clock clk  1  [get_ports {addr[15]}]
set_input_delay -clock clk  1  [get_ports {addr[14]}]
set_input_delay -clock clk  1  [get_ports {addr[13]}]
set_input_delay -clock clk  1  [get_ports {addr[12]}]
set_input_delay -clock clk  1  [get_ports {addr[11]}]
set_input_delay -clock clk  1  [get_ports {addr[10]}]
set_input_delay -clock clk  1  [get_ports {addr[9]}]
set_input_delay -clock clk  1  [get_ports {addr[8]}]
set_input_delay -clock clk  1  [get_ports {addr[7]}]
set_input_delay -clock clk  1  [get_ports {addr[6]}]
set_input_delay -clock clk  1  [get_ports {addr[5]}]
set_input_delay -clock clk  1  [get_ports {addr[4]}]
set_input_delay -clock clk  1  [get_ports {addr[3]}]
set_input_delay -clock clk  1  [get_ports {addr[2]}]
set_input_delay -clock clk  1  [get_ports {addr[1]}]
set_input_delay -clock clk  1  [get_ports {addr[0]}]
set_input_delay -clock clk  1  [get_ports {wdata[31]}]
set_input_delay -clock clk  1  [get_ports {wdata[30]}]
set_input_delay -clock clk  1  [get_ports {wdata[29]}]
set_input_delay -clock clk  1  [get_ports {wdata[28]}]
set_input_delay -clock clk  1  [get_ports {wdata[27]}]
set_input_delay -clock clk  1  [get_ports {wdata[26]}]
set_input_delay -clock clk  1  [get_ports {wdata[25]}]
set_input_delay -clock clk  1  [get_ports {wdata[24]}]
set_input_delay -clock clk  1  [get_ports {wdata[23]}]
set_input_delay -clock clk  1  [get_ports {wdata[22]}]
set_input_delay -clock clk  1  [get_ports {wdata[21]}]
set_input_delay -clock clk  1  [get_ports {wdata[20]}]
set_input_delay -clock clk  1  [get_ports {wdata[19]}]
set_input_delay -clock clk  1  [get_ports {wdata[18]}]
set_input_delay -clock clk  1  [get_ports {wdata[17]}]
set_input_delay -clock clk  1  [get_ports {wdata[16]}]
set_input_delay -clock clk  1  [get_ports {wdata[15]}]
set_input_delay -clock clk  1  [get_ports {wdata[14]}]
set_input_delay -clock clk  1  [get_ports {wdata[13]}]
set_input_delay -clock clk  1  [get_ports {wdata[12]}]
set_input_delay -clock clk  1  [get_ports {wdata[11]}]
set_input_delay -clock clk  1  [get_ports {wdata[10]}]
set_input_delay -clock clk  1  [get_ports {wdata[9]}]
set_input_delay -clock clk  1  [get_ports {wdata[8]}]
set_input_delay -clock clk  1  [get_ports {wdata[7]}]
set_input_delay -clock clk  1  [get_ports {wdata[6]}]
set_input_delay -clock clk  1  [get_ports {wdata[5]}]
set_input_delay -clock clk  1  [get_ports {wdata[4]}]
set_input_delay -clock clk  1  [get_ports {wdata[3]}]
set_input_delay -clock clk  1  [get_ports {wdata[2]}]
set_input_delay -clock clk  1  [get_ports {wdata[1]}]
set_input_delay -clock clk  1  [get_ports {wdata[0]}]
set_input_delay -clock clk  1  [get_ports {wstrb[3]}]
set_input_delay -clock clk  1  [get_ports {wstrb[2]}]
set_input_delay -clock clk  1  [get_ports {wstrb[1]}]
set_input_delay -clock clk  1  [get_ports {wstrb[0]}]
set_input_delay -clock clk  1  [get_ports req]
set_output_delay -clock clk  1  [get_ports {rdata[31]}]
set_output_delay -clock clk  1  [get_ports {rdata[30]}]
set_output_delay -clock clk  1  [get_ports {rdata[29]}]
set_output_delay -clock clk  1  [get_ports {rdata[28]}]
set_output_delay -clock clk  1  [get_ports {rdata[27]}]
set_output_delay -clock clk  1  [get_ports {rdata[26]}]
set_output_delay -clock clk  1  [get_ports {rdata[25]}]
set_output_delay -clock clk  1  [get_ports {rdata[24]}]
set_output_delay -clock clk  1  [get_ports {rdata[23]}]
set_output_delay -clock clk  1  [get_ports {rdata[22]}]
set_output_delay -clock clk  1  [get_ports {rdata[21]}]
set_output_delay -clock clk  1  [get_ports {rdata[20]}]
set_output_delay -clock clk  1  [get_ports {rdata[19]}]
set_output_delay -clock clk  1  [get_ports {rdata[18]}]
set_output_delay -clock clk  1  [get_ports {rdata[17]}]
set_output_delay -clock clk  1  [get_ports {rdata[16]}]
set_output_delay -clock clk  1  [get_ports {rdata[15]}]
set_output_delay -clock clk  1  [get_ports {rdata[14]}]
set_output_delay -clock clk  1  [get_ports {rdata[13]}]
set_output_delay -clock clk  1  [get_ports {rdata[12]}]
set_output_delay -clock clk  1  [get_ports {rdata[11]}]
set_output_delay -clock clk  1  [get_ports {rdata[10]}]
set_output_delay -clock clk  1  [get_ports {rdata[9]}]
set_output_delay -clock clk  1  [get_ports {rdata[8]}]
set_output_delay -clock clk  1  [get_ports {rdata[7]}]
set_output_delay -clock clk  1  [get_ports {rdata[6]}]
set_output_delay -clock clk  1  [get_ports {rdata[5]}]
set_output_delay -clock clk  1  [get_ports {rdata[4]}]
set_output_delay -clock clk  1  [get_ports {rdata[3]}]
set_output_delay -clock clk  1  [get_ports {rdata[2]}]
set_output_delay -clock clk  1  [get_ports {rdata[1]}]
set_output_delay -clock clk  1  [get_ports {rdata[0]}]
set_output_delay -clock clk  1  [get_ports ready]
set_output_delay -clock clk  1  [get_ports irq]
set_output_delay -clock clk  1  [get_ports pwr_compute_en]
set_voltage 1.05  -min 1.05  -object_list VDD_ALW
set_voltage 0.78  -min 0.78  -object_list VDD_COMP
set_voltage 0.78  -min 0.78  -object_list VDD_COMP_SW
set_voltage 0  -min 0  -object_list VSS
